import React, {Component} from 'react';
import {View, Text, StyleSheet, ScrollView} from 'react-native';

export default class App2 extends Component {
  render() {
    return (
      <View style={styles.container}>
        <ScrollView horizontal>
          <Text>
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!
            您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!您好!!!333
          </Text>
        </ScrollView>
      </View>
    );
  }
}

const styles = StyleSheet.create({
  container: {
    width: 200,
    height: 300,
    backgroundColor: 'pink',
  },
});
